app/controllers/destinations_controller.rb

SELECT "destinations".* FROM "destinations"
---
    def index
        destinations = Destination.all

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        destination = Destination.find(params[:id])

INSERT INTO "destinations" ("destination", "meals", "activities", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["destination", "Kilimambogo"], ["meals", "ice"], ["activities", "hiking"], ["price", 4500], ["created_at", "2022-12-11 08:32:43.014487"], ["updated_at", "2022-12-11 08:32:43.014487"]]
---
    def create
        destination = Destination.create!(destination_params)

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "destinations" SET "activities" = ?, "updated_at" = ? WHERE "destinations"."id" = ?  [["activities", "Eating"], ["updated_at", "2022-12-11 08:33:19.587100"], ["id", 1]]
---
    def update
        destination = Destination.find(params[:id])
        destination.update!(destination_params)