app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"
---
    def index
        reservations = Reservation.all

INSERT INTO "reservations" ("adults", "kids", "start_date", "end_date", "user_id", "destination_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
       reservation = Reservation.create!(reservation_params)