app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "phone_number", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "John Doe"], ["phone_number", 712345678], ["password_digest", "[FILTERED]"], ["created_at", "2022-12-11 09:25:31.456553"], ["updated_at", "2022-12-11 09:25:31.456553"]]

    def show
        user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def user
        user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def user
        user = User.find(params[:id])
        user.update!(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2022-12-11 09:30:03.881927"], ["id", 1]]